# DpartOriginalType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DpartOriginalType Property
ParameterTypeId Class See Also
---
"Original Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DpartOriginalType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DpartOriginalType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DpartOriginalType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace